{"slug":"vmworld-2021-as-speaker","title":"VMworld 2021 as speaker","date":"2021-10-11T00:00:00.000Z","excerpt":"VMworld 2021 has just ended... the first VMworld I took part in... as speaker!","tags":["Events","Cloud","Communities","VMware"],"html":"<p>VMworld 2021 has just ended! Due to the health worldwide emergency, the event\ntook place virtually. There were three days, from October 5th to 7th, full of\nkeynotes, sessions, round-tables and other social moments like were available\nonline and watchable directly from the people sofa!</p>\n<p>Among the other events, my good friend <a href=\"https://blog.linoproject.net\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Lino Telera</a>\nand me took a speech about Tanzu and how it can be used on different automation\nscenarios, both on infrastructure and application side.</p>\n<h2>My first time VMworld… as speaker</h2>\n<p>Even though it was not the first world tech conference I took part at, it has\nbeen the first time at a VMworld! For sure the priceless experience on\nconference is the possibility of networking (that’s also the most difficult part\nto replicate in a remote experience), the conference surprised me with the\ncompleteness of content for all the technical fields.</p>\n<p>Moreover being speaker at a world-wide event, gave me the right excitement\nnecessary to enjoy the conference at best and pushed me to perform better on the\n“virtual stage”! I don’t want to hide my head under the sand: the tension was\nvery high and I felt like the so-called <em>demo effect</em> was hunting for me…</p>\n<p>In the end all want for the best; In the next few lines I want to give you a\ngeneral overview of the speech.</p>\n<h2>Automate DevOps in a Cloud Native Way with VMware Tanzu</h2>\n<figure><picture class=\"svelte-1gy5t1o\"><source srcset=\"/images/posts/vmworld-2021-as-speaker/presenting.avif\" type=\"image/avif\">\n    <source srcset=\"/images/posts/vmworld-2021-as-speaker/presenting.webp\" type=\"image/webp\">\n    <img src=\"/images/posts/vmworld-2021-as-speaker/presenting.png\" alt=\"Screenshot of my Slides\" loading=\"lazy\" decoding=\"async\" class=\"svelte-1gy5t1o\"></picture>\n  \n</figure>\n<p>The recording of the speech is available on the <a href=\"https://www.vmware.com/vmworld/en/video-library/video-landing.html?sessionid=1620811753703001Iuro\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">VMworld On-Demand Video Library</a>.</p>\n<p>As a <em>Cloud Native Platform Engineer</em>, automation takes a big part of my\neveryday work, therefore I’ve spent a lot of time researching, designing,\ndeveloping and maintaining systems aimed at automating the work of both\ninfrastructure engineers and software developers.</p>\n<p>During the last years, I had the great opportunity to work with Lino Telera and\nbring all my experience on the field to realize a hybrid cloud infrastructure\nintegration and <span class=\"wrapper svelte-1sgfl7c\">pipelines for continuous integrations &amp;\ndelivery</span>; with the aim to automate the deployment of the\ninfrastructures and the whole applications lifecycle.</p>\n<p>In our session we have shown how VMware Tanzu and Tanzu Kubernetes Grid can take\nan important role in the automation field and how they can be integrated with a\nlot of DevOps technologies like Jenkins, Gitlab, Tekton, Flux, and Terraform.</p>\n<p>The presentation was oriented not only to infrastructure automation people but\nalso to DevOps pipeline because contained also application development scenarios\nand real-case demos.</p>\n<h2>What’s next?</h2>\n<p>That was not all! Another great experience happened during the VMworld days; it\nhas been such a great experience that it’s worth a dedicated blog post… so\nstay tuned!</p>","css":{"code":"picture.svelte-1gy5t1o.svelte-1gy5t1o{position:relative;width:100%;height:100%}picture.svelte-1gy5t1o img.svelte-1gy5t1o{width:100%;height:100%}\n.wrapper.svelte-1sgfl7c{background:var(--highlight-marker-url)}","map":null},"head":"","readingTime":"3 min read","relatedPosts":[]}